{"Ideate2D":{"slug":"Ideate2D","filePath":"Ideate2D.md","title":"Ideate2D","links":[],"tags":[],"content":"🎮 Ideate2D – Make Apps &amp; Games Without the Fuss\nIdeate2D is a WYSIWYG 2D game engine built on top of PyGame, designed to help you bring your ideas to life faster—whether you’re a complete beginner or an experienced dev who just wants to get things done.\n💡 Why Ideate2D?\n\nVisual-first: Draw your levels with your cursor, not just lines of code.\nPowered by PyGame: Full access to one of the most flexible Python game libraries under the hood.\nOpen Source: Modify the game engine however you like. It’s written in Python, too!\nNo setup nightmares: Get started in minutes. No bloated installs or complex configs.\nMade for rapid prototyping: Go from idea to interactive game fast—perfect for jams, class projects, or testing wild concepts.\n\nWhether you’re making your first game or prototyping your next big idea, Ideate2D helps you skip the boilerplate and focus on creativity.\nImportant\nThis software requires pygame to work. Pygame can be installed according the website: GettingStarted - pygame wiki\nInformation on the liabilities taken for this software and terms and conditions can be found at the bottom of the README.md file supplied with this software, and at github.com/shashankraocoding/Ideate2D. This software is distributed under the same license as Pygame (the  GNU LGPL version 2.1, also supplied with this software).\nWhat You See Is What You Get\nThe end product is exactly as it appears to you in the editor. Ideate2D holds this moto at its core. You design what you want without worrying about the basics, like scaling or image management, gravity, object physics, or any of the other million things you’d rather leave to us.\nLiability\nThis project, Ideate2D, was developed as an experimental tool and is provided on an “as-is” basis. While every effort has been made to ensure the accuracy and reliability of the functions and tools provided, no guarantees or warranties are given regarding their performance, correctness, or fitness for a particular purpose.\nImportant Disclaimers:\n\nUse at Your Own Risk\nNo Warranty: The author, and any contributors to this repository are not responsible for any errors, negligence, omissions, or damages resulting from the use or misuse of the software.\nBy using this software, you agree to assume all risks associated with its use.\n\nDownload Link Coming Soon\n \n\t \n\t\t.page-title { \n\t\t\tfont-size: 1.70rem; \n\t\t}\n\t \n"},"index":{"slug":"index","filePath":"index.md","title":"index","links":[],"tags":[],"content":" \n\t \n\t\twindow.location.href = `shashankraocoding.github.io/Ideate2D/Ideate2D.html` \n\t \n \n \n\t \n\t\t.page-title { \n\t\t\tfont-size: 1.70rem; \n\t\t}\n\t \n"}}